# the 4th chapter
>building good dataset for ML

## 1. Dealing with messing values
**to deal with messing values we can use**

1. drop missing data
2. Impute missing data

In [1]:
import pandas as pd
from io import StringIO

In [9]:
# Buildinging sample data
csv_data = '''A, B, C, D
1.0, 2.0, 3.0, 4.0
5.0, 6.0,, 8.0
10.0, 11.0, 12.0,'''

In [49]:
#Loading data
df = pd.read_csv(StringIO(csv_data))
df

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN

### 1- Drop messing data

***to check null values in columns***
 - df.values
> return array of DF values
 - df.isnull()
> return bool if null == True
 - df.isnull().sum()
> return sum of null

In [13]:
df.values

array([[ 1.,  2.,  3.,  4.],
       [ 5.,  6., nan,  8.],
       [10., 11., 12., nan]])

In [14]:
df.isnull()

       A      B      C      D
0  False  False  False  False
1  False  False   True  False
2  False  False  False   True

In [16]:
df.isnull().sum()

A     0
 B    0
 C    1
 D    1
dtype: int64

<br>

***to drop the null values***
- df.dropna(axis, how = "all", thresh, subset)
> drop null values in df
 - axis = 0 \>\> drop row / axis = 1 \>\>drop col
 - how = "all" , drop if all values is null
 - thresh = \<INT\> drop if real values \< \<INT\>
 - subject = \<col\> drop na in columnes

In [17]:
# drop null row
df.dropna(axis = 0)

     A    B    C    D
0  1.0  2.0  3.0  4.0

In [18]:
# drop null col
df.dropna(axis = 1)

      A     B
0   1.0   2.0
1   5.0   6.0
2  10.0  11.0

In [19]:
df.dropna(axis = 1, how = "all")

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN

In [23]:
df.dropna(axis = 0, thresh=4)

     A    B    C    D
0  1.0  2.0  3.0  4.0

<br><br>

### 2. Impute messing data
- replace missing values with another values
> - mean   : fill with mean of columnes value      # work with numerical values
> - median : the most frequent data in the column  # work with nun numerical values

*can be replaced with ***df.fillna(np.mean)****

In [54]:
# imppute null values with simple imputung
from sklearn.impute import SimpleImputer
import numpy as np

imr = SimpleImputer(missing_values=np.nan, strategy='mean')
imr = imr.fit(df.values)
imputed_data = imr.transform(df.values)
imputed_data

array([[ 1. ,  2. ,  3. ,  4. ],
       [ 5. ,  6. ,  7.5,  8. ],
       [10. , 11. , 12. ,  6. ]])

In [55]:
# replace null valuesw with mean of col
df.fillna(df.mean())

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   7.5  8.0
2  10.0  11.0  12.0  6.0